app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments"

  def create
    @service = Service.find(params[:service_id])
    @appointment = Appointment.new(appointment_params)
    @appointment.user = @current_user
    @appointment.service = @service

    if @appointment.save
---
SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
INSERT INTO "appointments" ("date", "time", "user_id", "created_at", "updated_at", "service_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2020-08-18"], ["time", "19:11"], ["user_id", 7], ["created_at", "2020-08-17 23:18:40.909503"], ["updated_at", "2020-08-17 23:18:40.909503"], ["service_id", 31]]

  def update
    if @appointment.update(appointment_params)
---
UPDATE "appointments" SET "name" = $1, "date" = $2, "time" = $3, "updated_at" = $4 WHERE "appointments"."id" = $5  [["name", "reflexology"], ["date", "2020-08-12"], ["time", "21:00"], ["updated_at", "2020-08-18 01:00:22.461347"], ["id", 6]]

  def destroy
    @appointment.destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 2]]

    def set_appointment
      @appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]