app/controllers/services_controller.rb

SELECT "services".* FROM "services"
---
  def index
    @services = Service.all

SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
    def set_service
      @service = Service.find(params[:id])